#+TITLE: Color themes customisation for Emacs

#+begin_src emacs-lisp :exports none
  ;;; -*- lexical-binding: t -*-
  ;; DO NOT EDIT THIS FILE DIRECTLY
  ;; This is a file generated from a literate programing source file
  ;; You should make any changes there and regenerate it from Emacs org-mode using C-c C-v t
#+end_src

** Switch colour themes from Emacs
Allow for switching the colour themes directly from ~Emacs~ by clicking on the name.

#+begin_src elisp :results output raw :eval never
;; switching color themes
(setq available-themes (mapcar 'symbol-name (custom-available-themes)))

(dolist (theme available-themes)
  (progn
    (princ (format "- [[elisp:(switch-to-theme '%s)][Switch %s]]\n" theme theme))))

(defun switch-to-theme (theme)
  (interactive)
  (dolist (theme custom-enabled-themes) (disable-theme theme))
  (load-theme theme))
#+end_src

#+RESULTS:
- [[elisp:(switch-to-theme 'atom-one-dark)][Switch atom-one-dark]]
- [[elisp:(switch-to-theme 'ayu-dark)][Switch ayu-dark]]
- [[elisp:(switch-to-theme 'ayu-grey)][Switch ayu-grey]]
- [[elisp:(switch-to-theme 'ayu-light)][Switch ayu-light]]
- [[elisp:(switch-to-theme 'ayu)][Switch ayu]]
- [[elisp:(switch-to-theme 'sanityinc-tomorrow-blue)][Switch sanityinc-tomorrow-blue]]
- [[elisp:(switch-to-theme 'sanityinc-tomorrow-bright)][Switch sanityinc-tomorrow-bright]]
- [[elisp:(switch-to-theme 'sanityinc-tomorrow-day)][Switch sanityinc-tomorrow-day]]
- [[elisp:(switch-to-theme 'sanityinc-tomorrow-eighties)][Switch sanityinc-tomorrow-eighties]]
- [[elisp:(switch-to-theme 'sanityinc-tomorrow-night)][Switch sanityinc-tomorrow-night]]
- [[elisp:(switch-to-theme 'darkokai)][Switch darkokai]]
- [[elisp:(switch-to-theme 'darktooth-dark)][Switch darktooth-dark]]
- [[elisp:(switch-to-theme 'darktooth-darker)][Switch darktooth-darker]]
- [[elisp:(switch-to-theme 'darktooth)][Switch darktooth]]
- [[elisp:(switch-to-theme 'doom-1337)][Switch doom-1337]]
- [[elisp:(switch-to-theme 'doom-Iosvkem)][Switch doom-Iosvkem]]
- [[elisp:(switch-to-theme 'doom-acario-dark)][Switch doom-acario-dark]]
- [[elisp:(switch-to-theme 'doom-acario-light)][Switch doom-acario-light]]
- [[elisp:(switch-to-theme 'doom-ayu-dark)][Switch doom-ayu-dark]]
- [[elisp:(switch-to-theme 'doom-ayu-light)][Switch doom-ayu-light]]
- [[elisp:(switch-to-theme 'doom-ayu-mirage)][Switch doom-ayu-mirage]]
- [[elisp:(switch-to-theme 'doom-badger)][Switch doom-badger]]
- [[elisp:(switch-to-theme 'doom-challenger-deep)][Switch doom-challenger-deep]]
- [[elisp:(switch-to-theme 'doom-city-lights)][Switch doom-city-lights]]
- [[elisp:(switch-to-theme 'doom-dark+)][Switch doom-dark+]]
- [[elisp:(switch-to-theme 'doom-dracula)][Switch doom-dracula]]
- [[elisp:(switch-to-theme 'doom-earl-grey)][Switch doom-earl-grey]]
- [[elisp:(switch-to-theme 'doom-ephemeral)][Switch doom-ephemeral]]
- [[elisp:(switch-to-theme 'doom-fairy-floss)][Switch doom-fairy-floss]]
- [[elisp:(switch-to-theme 'doom-feather-dark)][Switch doom-feather-dark]]
- [[elisp:(switch-to-theme 'doom-feather-light)][Switch doom-feather-light]]
- [[elisp:(switch-to-theme 'doom-flatwhite)][Switch doom-flatwhite]]
- [[elisp:(switch-to-theme 'doom-gruvbox-light)][Switch doom-gruvbox-light]]
- [[elisp:(switch-to-theme 'doom-gruvbox)][Switch doom-gruvbox]]
- [[elisp:(switch-to-theme 'doom-henna)][Switch doom-henna]]
- [[elisp:(switch-to-theme 'doom-homage-black)][Switch doom-homage-black]]
- [[elisp:(switch-to-theme 'doom-homage-white)][Switch doom-homage-white]]
- [[elisp:(switch-to-theme 'doom-horizon)][Switch doom-horizon]]
- [[elisp:(switch-to-theme 'doom-ir-black)][Switch doom-ir-black]]
- [[elisp:(switch-to-theme 'doom-lantern)][Switch doom-lantern]]
- [[elisp:(switch-to-theme 'doom-laserwave)][Switch doom-laserwave]]
- [[elisp:(switch-to-theme 'doom-manegarm)][Switch doom-manegarm]]
- [[elisp:(switch-to-theme 'doom-material-dark)][Switch doom-material-dark]]
- [[elisp:(switch-to-theme 'doom-material)][Switch doom-material]]
- [[elisp:(switch-to-theme 'doom-meltbus)][Switch doom-meltbus]]
- [[elisp:(switch-to-theme 'doom-miramare)][Switch doom-miramare]]
- [[elisp:(switch-to-theme 'doom-molokai)][Switch doom-molokai]]
- [[elisp:(switch-to-theme 'doom-monokai-classic)][Switch doom-monokai-classic]]
- [[elisp:(switch-to-theme 'doom-monokai-machine)][Switch doom-monokai-machine]]
- [[elisp:(switch-to-theme 'doom-monokai-octagon)][Switch doom-monokai-octagon]]
- [[elisp:(switch-to-theme 'doom-monokai-pro)][Switch doom-monokai-pro]]
- [[elisp:(switch-to-theme 'doom-monokai-ristretto)][Switch doom-monokai-ristretto]]
- [[elisp:(switch-to-theme 'doom-monokai-spectrum)][Switch doom-monokai-spectrum]]
- [[elisp:(switch-to-theme 'doom-moonlight)][Switch doom-moonlight]]
- [[elisp:(switch-to-theme 'doom-nord-aurora)][Switch doom-nord-aurora]]
- [[elisp:(switch-to-theme 'doom-nord-light)][Switch doom-nord-light]]
- [[elisp:(switch-to-theme 'doom-nord)][Switch doom-nord]]
- [[elisp:(switch-to-theme 'doom-nova)][Switch doom-nova]]
- [[elisp:(switch-to-theme 'doom-oceanic-next)][Switch doom-oceanic-next]]
- [[elisp:(switch-to-theme 'doom-old-hope)][Switch doom-old-hope]]
- [[elisp:(switch-to-theme 'doom-one-light)][Switch doom-one-light]]
- [[elisp:(switch-to-theme 'doom-one)][Switch doom-one]]
- [[elisp:(switch-to-theme 'doom-opera-light)][Switch doom-opera-light]]
- [[elisp:(switch-to-theme 'doom-opera)][Switch doom-opera]]
- [[elisp:(switch-to-theme 'doom-outrun-electric)][Switch doom-outrun-electric]]
- [[elisp:(switch-to-theme 'doom-palenight)][Switch doom-palenight]]
- [[elisp:(switch-to-theme 'doom-peacock)][Switch doom-peacock]]
- [[elisp:(switch-to-theme 'doom-pine)][Switch doom-pine]]
- [[elisp:(switch-to-theme 'doom-plain-dark)][Switch doom-plain-dark]]
- [[elisp:(switch-to-theme 'doom-plain)][Switch doom-plain]]
- [[elisp:(switch-to-theme 'doom-rouge)][Switch doom-rouge]]
- [[elisp:(switch-to-theme 'doom-shades-of-purple)][Switch doom-shades-of-purple]]
- [[elisp:(switch-to-theme 'doom-snazzy)][Switch doom-snazzy]]
- [[elisp:(switch-to-theme 'doom-solarized-dark-high-contrast)][Switch doom-solarized-dark-high-contrast]]
- [[elisp:(switch-to-theme 'doom-solarized-dark)][Switch doom-solarized-dark]]
- [[elisp:(switch-to-theme 'doom-solarized-light)][Switch doom-solarized-light]]
- [[elisp:(switch-to-theme 'doom-sourcerer)][Switch doom-sourcerer]]
- [[elisp:(switch-to-theme 'doom-spacegrey)][Switch doom-spacegrey]]
- [[elisp:(switch-to-theme 'doom-tokyo-night)][Switch doom-tokyo-night]]
- [[elisp:(switch-to-theme 'doom-tomorrow-day)][Switch doom-tomorrow-day]]
- [[elisp:(switch-to-theme 'doom-tomorrow-night)][Switch doom-tomorrow-night]]
- [[elisp:(switch-to-theme 'doom-vibrant)][Switch doom-vibrant]]
- [[elisp:(switch-to-theme 'doom-wilmersdorf)][Switch doom-wilmersdorf]]
- [[elisp:(switch-to-theme 'doom-xcode)][Switch doom-xcode]]
- [[elisp:(switch-to-theme 'doom-zenburn)][Switch doom-zenburn]]
- [[elisp:(switch-to-theme 'dracula)][Switch dracula]]
- [[elisp:(switch-to-theme 'flucui-dark)][Switch flucui-dark]]
- [[elisp:(switch-to-theme 'flucui-light)][Switch flucui-light]]
- [[elisp:(switch-to-theme 'github)][Switch github]]
- [[elisp:(switch-to-theme 'gruvbox-dark-hard)][Switch gruvbox-dark-hard]]
- [[elisp:(switch-to-theme 'gruvbox-dark-medium)][Switch gruvbox-dark-medium]]
- [[elisp:(switch-to-theme 'gruvbox-dark-soft)][Switch gruvbox-dark-soft]]
- [[elisp:(switch-to-theme 'gruvbox-light-hard)][Switch gruvbox-light-hard]]
- [[elisp:(switch-to-theme 'gruvbox-light-medium)][Switch gruvbox-light-medium]]
- [[elisp:(switch-to-theme 'gruvbox-light-soft)][Switch gruvbox-light-soft]]
- [[elisp:(switch-to-theme 'gruvbox)][Switch gruvbox]]
- [[elisp:(switch-to-theme 'kaolin-aurora)][Switch kaolin-aurora]]
- [[elisp:(switch-to-theme 'kaolin-blossom)][Switch kaolin-blossom]]
- [[elisp:(switch-to-theme 'kaolin-breeze)][Switch kaolin-breeze]]
- [[elisp:(switch-to-theme 'kaolin-bubblegum)][Switch kaolin-bubblegum]]
- [[elisp:(switch-to-theme 'kaolin-dark)][Switch kaolin-dark]]
- [[elisp:(switch-to-theme 'kaolin-eclipse)][Switch kaolin-eclipse]]
- [[elisp:(switch-to-theme 'kaolin-galaxy)][Switch kaolin-galaxy]]
- [[elisp:(switch-to-theme 'kaolin-light)][Switch kaolin-light]]
- [[elisp:(switch-to-theme 'kaolin-mono-dark)][Switch kaolin-mono-dark]]
- [[elisp:(switch-to-theme 'kaolin-mono-light)][Switch kaolin-mono-light]]
- [[elisp:(switch-to-theme 'kaolin-ocean)][Switch kaolin-ocean]]
- [[elisp:(switch-to-theme 'kaolin-shiva)][Switch kaolin-shiva]]
- [[elisp:(switch-to-theme 'kaolin-temple)][Switch kaolin-temple]]
- [[elisp:(switch-to-theme 'kaolin-valley-dark)][Switch kaolin-valley-dark]]
- [[elisp:(switch-to-theme 'kaolin-valley-light)][Switch kaolin-valley-light]]
- [[elisp:(switch-to-theme 'leuven-dark)][Switch leuven-dark]]
- [[elisp:(switch-to-theme 'leuven)][Switch leuven]]
- [[elisp:(switch-to-theme 'majapahit-dark)][Switch majapahit-dark]]
- [[elisp:(switch-to-theme 'majapahit-light)][Switch majapahit-light]]
- [[elisp:(switch-to-theme 'majapahit)][Switch majapahit]]
- [[elisp:(switch-to-theme 'material-light)][Switch material-light]]
- [[elisp:(switch-to-theme 'material)][Switch material]]
- [[elisp:(switch-to-theme 'modus-operandi-deuteranopia)][Switch modus-operandi-deuteranopia]]
- [[elisp:(switch-to-theme 'modus-operandi)][Switch modus-operandi]]
- [[elisp:(switch-to-theme 'modus-operandi-tinted)][Switch modus-operandi-tinted]]
- [[elisp:(switch-to-theme 'modus-vivendi-deuteranopia)][Switch modus-vivendi-deuteranopia]]
- [[elisp:(switch-to-theme 'modus-vivendi)][Switch modus-vivendi]]
- [[elisp:(switch-to-theme 'modus-vivendi-tinted)][Switch modus-vivendi-tinted]]
- [[elisp:(switch-to-theme 'monokai-alt)][Switch monokai-alt]]
- [[elisp:(switch-to-theme 'nano-dark)][Switch nano-dark]]
- [[elisp:(switch-to-theme 'nano-light)][Switch nano-light]]
- [[elisp:(switch-to-theme 'nano)][Switch nano]]
- [[elisp:(switch-to-theme 'poet-dark-monochrome)][Switch poet-dark-monochrome]]
- [[elisp:(switch-to-theme 'poet-dark)][Switch poet-dark]]
- [[elisp:(switch-to-theme 'poet-monochrome)][Switch poet-monochrome]]
- [[elisp:(switch-to-theme 'poet)][Switch poet]]
- [[elisp:(switch-to-theme 'solarized-dark-high-contrast)][Switch solarized-dark-high-contrast]]
- [[elisp:(switch-to-theme 'solarized-dark)][Switch solarized-dark]]
- [[elisp:(switch-to-theme 'solarized-gruvbox-dark)][Switch solarized-gruvbox-dark]]
- [[elisp:(switch-to-theme 'solarized-gruvbox-light)][Switch solarized-gruvbox-light]]
- [[elisp:(switch-to-theme 'solarized-light-high-contrast)][Switch solarized-light-high-contrast]]
- [[elisp:(switch-to-theme 'solarized-light)][Switch solarized-light]]
- [[elisp:(switch-to-theme 'solarized-selenized-black)][Switch solarized-selenized-black]]
- [[elisp:(switch-to-theme 'solarized-selenized-dark)][Switch solarized-selenized-dark]]
- [[elisp:(switch-to-theme 'solarized-selenized-light)][Switch solarized-selenized-light]]
- [[elisp:(switch-to-theme 'solarized-selenized-white)][Switch solarized-selenized-white]]
- [[elisp:(switch-to-theme 'solarized)][Switch solarized]]
- [[elisp:(switch-to-theme 'solarized-wombat-dark)][Switch solarized-wombat-dark]]
- [[elisp:(switch-to-theme 'solarized-zenburn)][Switch solarized-zenburn]]
- [[elisp:(switch-to-theme 'spacemacs-dark)][Switch spacemacs-dark]]
- [[elisp:(switch-to-theme 'spacemacs-light)][Switch spacemacs-light]]
- [[elisp:(switch-to-theme 'spacemacs)][Switch spacemacs]]
- [[elisp:(switch-to-theme 'adwaita)][Switch adwaita]]
- [[elisp:(switch-to-theme 'deeper-blue)][Switch deeper-blue]]
- [[elisp:(switch-to-theme 'dichromacy)][Switch dichromacy]]
- [[elisp:(switch-to-theme 'light-blue)][Switch light-blue]]
- [[elisp:(switch-to-theme 'manoj-dark)][Switch manoj-dark]]
- [[elisp:(switch-to-theme 'misterioso)][Switch misterioso]]
- [[elisp:(switch-to-theme 'tango-dark)][Switch tango-dark]]
- [[elisp:(switch-to-theme 'tango)][Switch tango]]
- [[elisp:(switch-to-theme 'tsdh-dark)][Switch tsdh-dark]]
- [[elisp:(switch-to-theme 'tsdh-light)][Switch tsdh-light]]
- [[elisp:(switch-to-theme 'wheatgrass)][Switch wheatgrass]]
- [[elisp:(switch-to-theme 'whiteboard)][Switch whiteboard]]
- [[elisp:(switch-to-theme 'wombat)][Switch wombat]]


